[
  {
    "path": "posts/2021-03-27-covid-deaths/",
    "title": "COVID-19: death statistics",
    "description": "This post is on the planning and prototyping process for one of the three sub-modules of a Shiny-based Visual Analytics Application project for the course *ISSS608 - Visual Analytics and Applications* offered in SMU MITB.",
    "author": [
      {
        "name": "amanda",
        "url": {}
      }
    ],
    "date": "2021-04-11",
    "categories": [],
    "contents": "\r\nOverview\r\nIn December 2019, the Coronavirus (COVID-19) has caught the world’s attention with the first COVID-19 cases reported in Wuhan, Hubei, China. Since then, the virus has spread like wildfire across the globe, with countries struggling to contain the virus to curb further spread and resurgence.\r\nExperts believe that COVID-19 is less deadly but more infectious than the Severe Acute Respiratory Syndrome (SARS) virus in 2003. Although the number of deaths due to COVID-19 reached a staggering 2.85 million worldwide, its case fatality ratio or rate (defined as the proportion of deaths among a defined population of interest, in this case, the number of COVID-19 cases) is estimated at 1.4% to 3.4%, a far cry from the 9.6% of SARS and 34.3% of the lesser known Middle East Respiratory Syndrome coronavirus (MERS-CoV). Of the 2.85 million deaths, how do countries compare against each other? This assignment aims to visualise the relationships between health, economic and population structure indicators with COVID-19 deaths across countries.\r\nReview of current visualisations on COVID-19 deaths\r\nMost visualisations report the death toll by location using geo-spatial, time-series and/or in tabular form (see Figure 1).\r\nFigure 1: Current visualisations on COVID-19 deaths.(a) Choropleth map of cumulative confirmed deaths per million people.Source: https://ourworldindata.org/covid-deaths (b) Proportional symbol map showing the case fatality ratio by location. Actual numbers are reported on the right side panel.Source: https://coronavirus.jhu.edu/map.html (c) Time-series of cumulative confirmed deaths per million people. Countries can be added or removed.Source: https://ourworldindata.org/covid-deaths (d) Table with horizontal bar charts and another time-series visualisation on the deaths reported per day.Source: https://pandemic.internationalsos.com/2019-ncov/covid-19-data-visualisationThese visualisations focus on comparing countries based on the number of deaths or case fatality rates. Comparisons are made based on visual encodings such as colour and size of data points. When used appropriately, users are able to perceive the information effectively (Figure 1-a to c). We can see that there is a lot of visual clutter when more countries are added, as seen in the time-series graph in Figure 1-d.\r\nMore details on number of deaths for individual countries are also provided via interactivity in some visualisations (see Figure 1-c for example). However, the comparisons are limited to the countries selected and it could be challenging to make comparisons when more countries are added. On the other hand, the table provides a single-view of the details across countries in descending order, but the numbers could be overwhelming for users to process even with the horizontal bar charts. Furthermore, a tabular layout makes it difficult to compare specific countries of interest.\r\nThere are lesser analyses that compare deaths or case fatality with other indicators. Some analyses study the impact of COVID-19 on the indicators while others study the impact of the indicators on the COVID-19 numbers. The review will focus on the analysis or visualisations used, which can potentially be employed to both types of analyses.\r\nScatterplot of economic indicators against number of deaths per million\r\nFigure 2: Scatterplot on change in GDP per capita against deaths per million.Source: https://theconversation.com/data-from-45-countries-show-containing-covid-vs-saving-the-economy-is-a-false-dichotomy-150533The scatterplot is useful in showing the relationship between two independent variables. In this scatterplot, size and colour scales are used to encode number of deaths and continent respectively. The size of the data points are not obvious from the graph due to the size range used, the 3-character country code labels and the choice of colour for Europe (the green stands out too much). The overlap in data points belonging to the same continent also make it difficult to identify the data points. There is no interactivity in this visualisation.\r\nFunnel plot of case fatality rate against number of confirmed cases\r\nThere are two similar visualisations created specifically for COVID-19 case fatality rate for counties in the US by a SAS researcher Rick Wicklin (see Figure 3). Unlike the time-series, geo-spatial and tabular visualisations where users make comparisons based on the face-value of the numbers, the funnel plot seeks to highlight any anomalies from the expected range of the numerical values based on statistical concepts. Note that the factors plotted on a funnel plot are dependent on each other, i.e. the number of confirmed cases is used to calculate the case fatality rate.\r\nFigure 3: Funnel plot on case fatality rate against number of confirmed cases.Source: https://blogs.sas.com/content/iml/2020/04/22/funnel-plot-covid-us.htmlThe drawback of the visualisations is that the funnel plots are static with no interactivity: users are unable to identify the other data points that are not labelled by the author.\r\nTabular presentation of correlation index between socio-economic indicators and number of deaths per million\r\nThe study “Rich at risk: socio-economic drivers of COVID-19 pandemic spread” by Gangemi, S., Billeci, L. & Tonacci, A. (2020) seeks to understand the spread of the COVID-19 virus driven by socio-economic factors and long-distance transportations. The results are presented in a table (see Figure 4). Although the presentation of the results are not visually appealing, this study sheds light on the current analysis performed for COVID-19 deaths.\r\nFigure 4: Table of correlations between socio-economic indicators and number of cases per million and number of deaths per million.Source: https://clinicalmolecularallergy.biomedcentral.com/articles/10.1186/s12948-020-00127-4Scatterplot with fit line and regression model summary table to predict number of new deaths\r\nThe visualisations discussed thus far are bivariate in nature: analysis of each factor with the number of deaths. There are very few multivariate analysis done, and of those conducted, most of them are presented in tabular form or described in text. There is one study on regression models to predict the number of COVID-19 new deaths, which presents its findings visually in the research paper (see Figure 5).\r\nFigure 5: (Left) Table showing the regression models summaries and parameter estimates to predict new COVID-19 deaths. (Right) Scatterplot with fit lines comparing the regression models built to predict new COVID-19 deaths by day.Source: https://www.medrxiv.org/content/10.1101/2020.09.04.20188094v1.full.pdfAlthough the intention of the assignment is an exploratory analysis, we can still gain some insights from the visualisation used in this predictive regression analysis. It is noted that the regression models built are to predict the number of new deaths by day for a particular location, Ethiopia, solely based on COVID-19 related indicators. The scatterplot with fit lines allows users to visually compare the different regression models built. There is no interactivity in this graph as it is used for reporting purposes.\r\nSuggested visualisations and R packages\r\nThere are gaps in the current visualisations in supporting the intended analysis of this assignment. The majority of interactive visualisations are univariate presented on maps or in time series, while the bivariate and multivariate analysis of the country indicators and the number of deaths are largely static.\r\nIn this assignment, we will attempt to create interactive visualisations for bivariate (scatterplot and funnel plot) and multivariate analysis (multiple linear regression) of the number of deaths due to COVID-19 with selected health-socio-economic indicators across countries.\r\nThe following R packages will be explored:\r\nVisualisation\r\nPackages\r\nScatterplot\r\nggplot, ggstatsplot, car\r\nFunnel Plot\r\nggplot, FunnelPlotR, metafor, metaviz, funnelR\r\nMultivariate Analysis\r\nmlr, olsrr\r\nInteractivity\r\nggplotly\r\nData Preparation\r\nLoading all necessary packages for file import\r\nThe following code chunk loads the necessary packages required for importing data files.\r\n\r\n\r\n\r\nImporting files into R\r\nImport and selection of variables\r\n\r\n\r\n\r\nCleaning the data\r\nWant to join all values into one main table covid_deaths. Look at each dataset to prep before joining.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n# A tibble: 202 x 26\r\n   iso_code continent    location         last_updated_da~ total_cases\r\n   <chr>    <chr>        <chr>            <date>                 <dbl>\r\n 1 AFG      Asia         Afghanistan      2021-03-27             56290\r\n 2 ALB      Europe       Albania          2021-03-27            123641\r\n 3 DZA      Africa       Algeria          2021-03-27            116750\r\n 4 AND      Europe       Andorra          2021-03-27             11809\r\n 5 AGO      Africa       Angola           2021-03-27             22031\r\n 6 AIA      North Ameri~ Anguilla         2021-03-19                NA\r\n 7 ATG      North Ameri~ Antigua and Bar~ 2021-03-27              1122\r\n 8 ARG      South Ameri~ Argentina        2021-03-27           2301389\r\n 9 ARM      Asia         Armenia          2021-03-27            189540\r\n10 AUS      Oceania      Australia        2021-03-27             29259\r\n# ... with 192 more rows, and 21 more variables: total_deaths <dbl>,\r\n#   total_tests <dbl>, positive_rate <dbl>, population <dbl>,\r\n#   population_density <dbl>, gdp_per_capita <dbl>,\r\n#   extreme_poverty <dbl>, handwashing_facilities <dbl>,\r\n#   hospital_beds_per_thousand <dbl>, human_development_index <dbl>,\r\n#   0_to_14(%) <dbl>, 15_to_64(%) <dbl>, 65_and_above(%) <dbl>,\r\n#   annual_intl_arrivals_thousands <dbl>, year_personnel <dbl>,\r\n#   num_physicians_per_thousand <dbl>, year_exp <dbl>,\r\n#   current_health_exp_%gdp <dbl>,\r\n#   domestic_govt_health_exp_%totalgovtexp <dbl>, lat <dbl>,\r\n#   long <dbl>\r\n\r\nReordering the columns in the data frame\r\n\r\n\r\n\r\n\r\n\r\n\r\nPrototype\r\nStoryboard\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-27-covid-deaths/covid-deaths_files/figure-html5/unnamed-chunk-9-1.png",
    "last_modified": "2021-04-06T15:18:58+08:00",
    "input_file": "covid-deaths.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-23",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-23T22:42:54+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-23-visual-analystic-project-proposal/",
    "title": "Visualisation and Analysis of Patient Psychosocial Acuity",
    "description": "Project Proposal",
    "author": [
      {
        "name": "Lin YongYan, Siow Mun Chai, Tan Wei Li Amanda",
        "url": "www.smu.edu.sg"
      }
    ],
    "date": "2021-02-23",
    "categories": [],
    "contents": "\r\nIntroduction\r\nOne of the three shifts that the Singapore government is making to keep healthcare affordable and sustainable is to bring healthcare closer to homes and support ageing in the community. To achieve this, public healthcare services are organised into three clusters overseeing a specific region:\r\nCentral region: National Healthcare Group (NHG)\r\nEastern region: Singapore Health Services (SingHealth)\r\nWestern region: National University Health System (NUHS)\r\nThis segregation would allow the clusters to better coordinate care delivery along the care continuum from primary, acute, intermediate to long-term care, in their respective regions (Ministry of Health, Singapore, 2018).\r\nIn Singapore General Hospital, part of the SingHealth cluster, the Community Care Team (CCT), comprising of Medical Social Workers (MSWs), was formed in mid 2018. The aim of the CCT is to facilitate person-centred care in the community and to enable patients to remain in the community as long as possible. This is achieved through collaboration with community partners to meet patient psychosocial needs with health and social issues.\r\nIn order to explore the breadth and depth of psychosocial needs in the community and to devise targeted intervention strategies to address them, the Psychosocial Acuity Scale (PAS), established in the University of Michigan Health System, Ann Arbor, was introduced and is being used to capture patient’s data based on their psychosocial needs (Klett, Firn, Abney, Battles, Harrington & Vantine, 2014). The PAS is a clinical measure and tool used to assess the patient/family/community situation prior to any social work involvement. It consists of seven domains, with each domain having four acuity levels.\r\nThis project looks at providing an application to aid in the visualisation and analysis of the data collected by the CCT MSWs.\r\nMotivation\r\nThe project team is motivated to help the CCT MSWs to discover trends and gain insights on the psychosocial acuity of patients in the community. The analysis tool will enable the MSW team to identify current trends and service needs, which would in turn inform the MSWs on the potential intervention strategies required in the community. This would have both practice and health and social care policy implications on enabling patients to age well in the community.\r\nWhile the dataset is meant for data analysis, it has been mainly used for case monitoring and workload statistics purposes. To enhance and facilitate the analysis task for the MSWs, the project team will attempt to provide an easy-to-use and interactive application. It is also an opportune time to start analysing their data, after allowing the CCT team’s systems and processes to stabilise since its formation in mid 2018.\r\nData\r\nThe data is split into three files, one for each MSW. The fields can be categorised into the following areas:\r\nPatient’s sociodemographics and postal code\r\nReferral details\r\nMSW assessment details including the PAS levels\r\nEach file contains the patient assessment records done by the respective MSW from mid 2018 to 2020. There could be repeated assessments for the same patient at different times.\r\nMethodology and Approach\r\nThe following is the proposed scope of the project.\r\nAnalysis and preparation of PAS dataset\r\nExploratory Data Analysis (EDA)\r\nTime Series and Geo-spatial Analysis\r\nClustering Analysis\r\nMultiple Linear Regression (MLR) and Predictive Modelling\r\nDevelopment of R-Shiny mobile application for user interactivity\r\nStoryboard\r\nThere will be four sections in the final app. The first section will be on Time Series and Geo-spatial Analysis. The second section will be on Clustering Analysis and the third section will be on Regression and Prediction Modelling. The fourth section will allow the user to explore with the data used in the application.\r\nProposed layouts and features of the sections are as follow.\r\nTime Series & Geo-Spatial Analysis\r\n\r\n\r\n\r\nFigure 1: Proposed screen for Time Series and Geo-Spatial Analysis\r\n\r\n\r\n\r\nClustering Analysis\r\n\r\n\r\n\r\nFigure 2: Proposed screen for Clustering Analysis\r\n\r\n\r\n\r\nRegression and Predictive Modelling\r\n\r\n\r\n\r\nFigure 3: Proposed screen for Regression and Predictive Modelling\r\n\r\n\r\n\r\nData Exploration\r\n\r\n\r\n\r\nFigure 4: Proposed screen for Data Exploration\r\n\r\n\r\n\r\nProject Timeline\r\n\r\n\r\n\r\nFigure 5: Project Timeline\r\n\r\n\r\n\r\nSoftware Tool\r\nThe application will be written in R using RStudio.\r\nR Packages\r\nThe following R packages would be used:\r\nDT: https://cran.r-project.org/web/packages/DT\r\nggplot2: https://cran.r-project.org/web/packages/ggplot2/index.html\r\nleaflet: https://cran.r-project.org/web/packages/leaflet\r\nlubridate: https://cran.r-project.org/web/packages/lubridate/index.html\r\nplotly: https://cran.r-project.org/web/packages/plotly\r\nreadr: https://cran.r-project.org/web/packages/readr\r\nshiny: https://shiny.rstudio.com\r\nshinythemes: https://cran.r-project.org/web/packages/shinythemes\r\nshinyWidgets: https://cran.r-project.org/web/packages/shinyWidgets\r\ntidyverse: https://www.tidyverse.org\r\ncorrplot: https://cran.r-project.org/web/packages/corrplot\r\npurr: https://cran.r-project.org/web/packages/purrr/index.html\r\nrgdal: https://cran.r-project.org/web/packages/rgdal\r\nrgeos: https://cran.r-project.org/web/packages/rgeos\r\ncluster: https://cran.r-project.org/web/packages/cluster/index.html\r\ndendextend https://cran.r-project.org/web/packages/dendextend\r\nMASS: https://cran.r-project.org/web/packages/MASS/index.html\r\nReferences\r\nMinistry of Health, Singapore (14 Aug 2018). Opening Address by Dr Amy Khor, Senior Minister of State, Ministry of Health, at the Singapore Healthcare Management Congress 2018, 14 August 2018. Retrieved from https://www.moh.gov.sg/news-highlights/details/opening-address-by-dr-amy-khor-senior-minister-of-state-ministry-of-health-at-the-singapore-healthcare-management-congress-2018-14-august-2018\r\nKlett, S., Firn, J., Abney, N., Battles, A., Harrington, J., & Vantine, A. (2014). Developing a reliable and valid scale to measure psychosocial acuity. Social work in health care, 53(5), 503–517. https://doi.org/10.1080/00981389.2014.898726\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-23-visual-analystic-project-proposal/image/Sketch_TSGS_analysis.jpg",
    "last_modified": "2021-02-28T23:02:31+08:00",
    "input_file": "visual-analystic-project-proposal.utf8.md"
  }
]
